AdityaDk10/UbicompLab-Pic24/main.c
// Display text centered horizontally on screen
void DisplayCentered(const char* text) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    uint8_t textWidth = GetStringWidth(text);
    int16_t xPos = (DISP_HOR_RESOLUTION - textWidth) / 2;
    int16_t yPos = 24; // Middle page
    
    DrawString(xPos, yPos, text);
}

// Display message for specified duration (in seconds)
void ShowMessage(const char* text, uint8_t seconds) {
    DisplayCentered(text);
    delay(seconds * 1000);
}

// Blink RGB LED with given color a number of times
void BlinkRGB(uint8_t r, uint8_t g, uint8_t b, uint8_t times, uint16_t onMs, uint16_t offMs) {
    for (uint8_t i = 0; i < times; i++) {
        SetRGBs(r, g, b);       // LED on with requested color
        delay(onMs);
        SetRGBs(0, 0, 0);       // LED off
        delay(offMs);
    }
}

// Display two lines of text
void DisplayTwoLines(const char* line1, const char* line2) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    uint8_t width1 = GetStringWidth(line1);
    int16_t x1 = (DISP_HOR_RESOLUTION - width1) / 2;
    DrawString(x1, 16, line1);
    
    uint8_t width2 = GetStringWidth(line2);
    int16_t x2 = (DISP_HOR_RESOLUTION - width2) / 2;
    DrawString(x2, 40, line2);
}

// Draw main menu with a rectangular highlight around the selected option
// selectedIndex: 0 = REGISTER, 1 = LOGIN, 2 = DELETE, 3 = LIST
void DrawMainMenu(uint8_t selectedIndex) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);

    const char* regText = "REGISTER";
    const char* loginText = "LOGIN";
    const char* deleteText = "DELETE";
    const char* listText = "LIST";

    // Y positions for the four options (adjusted spacing to fit all 4 items)
    const int16_t yReg = 6;
    const int16_t yLogin = 22;
    const int16_t yDelete = 38;
    const int16_t yList = 54;

    // Draw text centered
    uint8_t widthReg = GetStringWidth(regText);
    int16_t xReg = (DISP_HOR_RESOLUTION - widthReg) / 2;
    DrawString(xReg, yReg, regText);

    uint8_t widthLogin = GetStringWidth(loginText);
    int16_t xLogin = (DISP_HOR_RESOLUTION - widthLogin) / 2;
    DrawString(xLogin, yLogin, loginText);

    uint8_t widthDelete = GetStringWidth(deleteText);
    int16_t xDelete = (DISP_HOR_RESOLUTION - widthDelete) / 2;
    DrawString(xDelete, yDelete, deleteText);

    uint8_t widthList = GetStringWidth(listText);
    int16_t xList = (DISP_HOR_RESOLUTION - widthList) / 2;
    DrawString(xList, yList, listText);

    // Draw highlight rectangle around the selected option
    const int8_t paddingX = 4;
    const int8_t paddingY = 2;  // Reduced to prevent overlap with menu items below
    int16_t rectX, rectY, rectW, rectH;

    if (selectedIndex == 0) {
        rectX = xReg - paddingX;
        rectY = yReg - paddingY;
        rectW = widthReg + 2 * paddingX;
        rectH = 12 + 2 * paddingY;  // Approximate text height
    } else if (selectedIndex == 1) {
        rectX = xLogin - paddingX;
        rectY = yLogin - paddingY;
        rectW = widthLogin + 2 * paddingX;
        rectH = 12 + 2 * paddingY;  // Approximate text height
    } else if (selectedIndex == 2) {
        rectX = xDelete - paddingX;
        rectY = yDelete - paddingY;
        rectW = widthDelete + 2 * paddingX;
        rectH = 12 + 2 * paddingY;  // Approximate text height
    } else {  // selectedIndex == 3 (LIST)
        rectX = xList - paddingX;
        rectY = yList - paddingY;
        rectW = widthList + 2 * paddingX;
        rectH = 12 + 2 * paddingY;  // Approximate text height
    }

    // Draw rectangle outline using four lines
    DrawLine(rectX, rectY, rectX + rectW, rectY);               // top
    DrawLine(rectX, rectY + rectH, rectX + rectW, rectY + rectH); // bottom
    DrawLine(rectX, rectY, rectX, rectY + rectH);               // left
    DrawLine(rectX + rectW, rectY, rectX + rectW, rectY + rectH); // right
}


// ==================== PATTERN INPUT ====================

// Check if button is already in pattern (no repeats)
uint8_t IsInPattern(uint8_t* pattern, uint8_t length, uint8_t button) {
    for (uint8_t i = 0; i < length; i++) {
        if (pattern[i] == button) return 1;
    }
    return 0;
}

// Collect pattern using swipe detection (like ball movement)
// Also captures timing between button presses in milliseconds
void CollectPattern(uint8_t* pattern, uint16_t* timing) {
    uint8_t patternLen = 0;
    int16_t aggr[5] = {0, 0, 0, 0, 0};
    uint8_t lastButton = 0xFF;  // Last button added to pattern
    const int16_t THRESHOLD = 6;
    const int16_t RELEASE_THRESHOLD = 2;
    const uint16_t timeout = 10;
    
    uint32_t lastButtonTime = 0;  // Time when last button was added (in loop iterations)
    uint32_t currentTime = 0;     // Current time counter (in loop iterations)
    
    // Initialize timing array
    for (uint8_t i = 0; i < PATTERN_LENGTH - 1; i++) {
        timing[i] = 0;
    }
    
    // Show initial grid
    SetColor(BLACK);
    ClearDevice();
    DrawPatternGrid();
    
    // Collect pattern until 5 buttons
    while (patternLen < PATTERN_LENGTH) {
        ReadCTMU();
        
        // Update aggregate values (same as ball movement logic)
        for (uint8_t i = 0; i < 5; i++) {
            if (buttons[i]) aggr[i]++;
            else aggr[i]--;
            if (aggr[i] < 0) aggr[i] = 0;
            if (aggr[i] > 30) aggr[i] = 30;
        }
        
        // Find which button currently has highest aggregate
        int16_t maxVal = THRESHOLD;
        uint8_t currentButton = 0xFF;
        for (uint8_t i = 0; i < 5; i++) {
            if (aggr[i] > maxVal) {
                maxVal = aggr[i];
                currentButton = i;
            }
        }
        
        // If touching a valid button
        if (currentButton != 0xFF) {
            uint8_t buttonNum = currentButton + 1;  // Convert 0-4 to 1-5
            
            // Check if it's a NEW button (not the same as last, not already in pattern)
            if (currentButton != lastButton && !IsInPattern(pattern, patternLen, buttonNum)) {
                // Calculate timing since last button (if not first button)
                if (patternLen > 0) {
                    // Time difference in loop iterations, convert to milliseconds
                    uint32_t timeDiff = currentTime - lastButtonTime;
                    timing[patternLen - 1] = (uint16_t)(timeDiff * timeout);  // Convert to milliseconds
                }
                
                // Add to pattern
                pattern[patternLen] = buttonNum;
                patternLen++;
                lastButton = currentButton;
                lastButtonTime = currentTime;  // Record time when this button was added
                
