AdityaDk10/UbicompLab-Pic24/main.c
        } else if (selectedIndex == 2) {  // DELETE selected
            // Delete user flow
            ShowMessage("DELETE MENU", 1);
            ShowMessage("LOADING...", 2);
            
            // Check if database is empty
            if (userCount == 0) {
                DisplayTwoLines("FIRST REGISTER", "USERS!");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // Prompt for ID
            DisplayTwoLines("PLEASE ENTER", "ID");
            delay(2000);
            
            // Collect 2-digit ID (automatically proceeds)
            int16_t userId = CollectDigits(2, "ID");
            
            // Check if user exists
            int8_t userIndex = FindUser(userId);
            if (userIndex == -1) {
                ShowMessage("CHECKING...", 1);
                // Failure: invalid user ID -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                DisplayTwoLines("INVALID", "USER ID!");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // Prompt for Pattern (authentication required)
            DisplayTwoLines("AUTHENTICATE", "TO DELETE");
            delay(2000);
            
            // Collect 5-button pattern (swipe-based)
            uint8_t pattern[PATTERN_LENGTH];
            uint16_t timing[PATTERN_LENGTH - 1];
            CollectPattern(pattern, timing);
            
            // Validate credentials
            ShowMessage("CHECKING...", 2);
            uint8_t timingWarning = 0;
            if (ValidateLogin(userId, pattern, timing, &timingWarning)) {
                // Check if timing warning should be shown
                if (timingWarning) {
                    // Show timing warning but still allow deletion
                    DisplayTwoLines("TIMING WARNING", "");
                    delay(2000);
                }
                
                // Authentication successful - show confirmation alert
                DisplayTwoLines("DELETE USER?", "CENTER=YES");
                delay(2000);
                
                // Wait for confirmation (CENTER = confirm, any other = cancel)
                uint8_t confirmBtn = WaitForButton();
                
                if (confirmBtn == 4) {  // CENTER = YES, confirm deletion
                    // Delete the user
                    if (DeleteUser(userId)) {
                        // Success: deletion -> GREEN blink
                        BlinkRGB(0, 255, 0, 3, 200, 200);
                        DisplayTwoLines("USER", "DELETED!");
                        delay(2000);
                    } else {
                        // Failure: deletion failed -> RED blink
                        BlinkRGB(255, 0, 0, 3, 200, 200);
                        DisplayTwoLines("DELETE", "FAILED!");
                        delay(2000);
                    }
                } else {
                    // User cancelled - no action
                    DisplayTwoLines("CANCELLED", "");
                    delay(2000);
                }
            } else {
                // Authentication failed - don't allow deletion
                // Failure: wrong pattern -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                DisplayTwoLines("AUTH FAILED!", "");
                delay(3000);
            }
            ShowMessage("REDIRECTING...", 1);
            
        } else if (selectedIndex == 3) {  // LIST selected
            // List all registered users with statistics
            ShowMessage("LIST MENU", 1);
            ShowMessage("LOADING...", 1);
            
            // Check if database is empty
            if (userCount == 0) {
                DisplayTwoLines("NO USERS", "REGISTERED!");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // Count logged in users and locked accounts
            uint8_t loggedInCount = 0;
            uint8_t lockedCount = 0;
            for (uint8_t i = 0; i < 10; i++) {
                if (userDatabase[i].isActive) {
                    if (userDatabase[i].isLoggedIn) {
                        loggedInCount++;
                    }
                    if (userDatabase[i].failedAttempts >= 3) {
                        lockedCount++;
                    }
                }
            }
            
            // Display statistics screen
            SetColor(BLACK);
            ClearDevice();
            SetColor(WHITE);
            
            // Show statistics header
            DrawString(24, 4, "USER STATISTICS:");
            
            // Show total registered users
            char totalMsg[30];
            sprintf(totalMsg, "TOTAL: %d", userCount);
            DrawString(8, 18, totalMsg);
            
            // Show logged in users
            char loggedMsg[30];
            sprintf(loggedMsg, "LOGGED IN: %d", loggedInCount);
            DrawString(8, 30, loggedMsg);
            
            // Show locked accounts
            char lockedMsg[30];
            sprintf(lockedMsg, "LOCKED: %d", lockedCount);
            DrawString(8, 42, lockedMsg);
            
            // Wait for button press to see user list
            delay(3000);
            WaitForButton();
            
            // Display user list with status
            SetColor(BLACK);
            ClearDevice();
            SetColor(WHITE);
            
            DrawString(32, 4, "USER LIST:");
            
            // Display users with their status
            uint8_t displayCount = 0;
            uint8_t shownCount = 0;
            for (uint8_t i = 0; i < 10 && shownCount < 4; i++) {
                if (userDatabase[i].isActive) {
                    char userLine[30];
                    char status[10] = "";
                    
                    // Determine status
                    if (userDatabase[i].isLoggedIn) {
                        sprintf(status, " [IN]");
                    } else if (userDatabase[i].failedAttempts >= 3) {
                        sprintf(status, " [LOCK]");
                    }
                    
                    sprintf(userLine, "ID:%02d%s", userDatabase[i].userId, status);
                    DrawString(8, 16 + displayCount * 12, userLine);
                    displayCount++;
                    shownCount++;
                }
            }
            
            // If there are more users, show indicator
            if (userCount > 4) {
                char moreMsg[20];
                sprintf(moreMsg, "...%d MORE", userCount - 4);
                DrawString(8, 16 + displayCount * 12, moreMsg);
            }
            
            // Wait for button press to return to menu
            delay(2000);
            WaitForButton();
            ShowMessage("REDIRECTING...", 1);
    }
    }
    
    RGBTurnOffLED();
}
